// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

int a = 891;

a = a % 100;
a = a / 10;
System.Console.WriteLine(a);